{
  "Version": 1,
  "Name": "Copperbell Mines",
  "InternalName": "CopperbellMinesHard",
  "Difficulty": 1,
  "Type": 0,
  "Expansion": 0,
  "Level": 50,
  "UnlockQuestID": 66752,
  "TerritoryIDs": [
    349
  ],
  "Sections": [
    {
      "Type": 0,
      "Name": "Hecatoncheir Mastermind",
      "Phases": [
        {
          "Strategy": "Pulling the boss to the end of the Flaming Track is the easiest way to deal with this fight with a decent group. Be aware that doing so will spawn all of the upcoming mechanics in sequence instead of over the course of the fight, as they are tied to when the Flaming Track is activated.\n\nThe closer you are to the end of the track, the faster the Flambeau's will use Self-destruct.",
          "KeyMechanics": [
            {
              "Name": "Mining Dross",
              "Description": "There are three packs of three slimes each on the wooden track. Group up and AoE down.",
              "Type": 7
            },
            {
              "Name": "Flambeau",
              "Description": "Moves towards the Flaming Track and begins casting Self-destruct after a few seconds. Must be killed ASAP or it will wipe the group.",
              "Type": 7
            },
            {
              "Name": "Flaming Track",
              "Description": "The boss will set fire to the floor behind him and beneath him at set intervals OR when he moves past a certain point on the floor.",
              "Type": 2
            },
            {
              "Name": "Hecatoncheir Adds",
              "Description": "Weak adds that can be burned down quickly.",
              "Type": 7
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Biggy",
      "Phases": [
        {
          "Strategy": "Tanks should stand apart from the group as the boss will use various AoEs on them while running around the room.\n\nWhen placing the bomb, try to place it a few seconds in front of the boss to ensure that it will hit him. Adjust for when he uses AoEs. Try to wait until there's only a few seconds left on the timer for best chances of hitting him.\n\nIf you have a left over Waymaker Bomb you can use it on Biggy when he emerges from the Rock Suit, instantly finishing him off.",
          "KeyMechanics": [
            {
              "Name": "Rock Suit",
              "Description": "The boss spawns wearing a giant rock golem suit to defend himself from damage. Boss takes extremely low damage from player attacks; instead, use Waymaker Bombs to bring him down. After being hit by the first Waymaker Bomb, the boss will run around the room, ignoring aggro. Tanks should continue to hold aggro and stand on the west side of the room, near the exit, to encourage the boss to use its various attacks in their direction so they don't hit the other players.",
              "Type": 5
            },
            {
              "Name": "Improved Blasting Device",
              "Description": "Respawns regularly on the east side of the room. Used to spawn Waymaker Bombs somewhere in the room.",
              "Type": 10
            },
            {
              "Name": "Waymaker Bomb",
              "Description": "Spawned by the Improved Blasting Device. Used to damage the boss' Rock Suit. Must be picked up by a player and placed in the boss' path; they will explode ~15 seconds after they are first summoned. Deals about ~10% of the boss' health.",
              "Type": 10
            },
            {
              "Name": "Kindling Sprite",
              "Description": "A fire sprite that spawns regularly in random locations of the room. Must be killed quickly as it deals moderate damage to whoever it targets.",
              "Type": 7
            },
            {
              "Name": "Blasting Cap",
              "Description": "A trio of three bombs spawns near the Improved Blasting Device and use Self-destruct, which hits for heavy (or fatal) damage.",
              "Type": 2
            },
            {
              "Name": "Rockslide",
              "Description": "Instant cast long line AoE aimed at the MT. Deals moderate damage. Replaced by Earthen Heart at around ~20%.",
              "Type": 2
            },
            {
              "Name": "Stone Skull",
              "Description": "The boss will headbutt the MT, dealing light damage.",
              "Type": 10
            },
            {
              "Name": "Plaincracker",
              "Description": "A large AoE centered on the boss that deals moderate damage.",
              "Type": 2
            },
            {
              "Name": "Earthen Heart",
              "Description": "Drops a large blue puddle AoE on a random patch of ground. Stepping into the puddle while carrying a Waymaker Bomb will make it explode.",
              "Type": 2
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Ouranos",
      "Phases": [
        {
          "Strategy": "Keep an eye on the chat log to see when to feed a Crystalized Rock to the Abyss Worm.\n\nAvoid standing in Mercurial Strike.\n\nHealers should be ready to dispel any Slow debuffs from players caught in Power Attack.",
          "KeyMechanics": [
            {
              "Name": "Crystalized Rock",
              "Description": "Spawns around the outside of the arena. Limited resource. Used to pacify the Abyss Worm.",
              "Type": 10
            },
            {
              "Name": "Abyss Worm",
              "Description": "Will travel around the sand in the center of the room. Occasionally, a message saying \"The abyss worm is searching for fodder.\" will appear. At this time, a player should pick up a Crystalized Rock and drop it somewhere inside the sand pit. If unfed, will pull all players to the center of the sandpit, dealing moderate damage.",
              "Type": 2
            },
            {
              "Name": "Mercurial Strike",
              "Description": "Large AoE centered on the boss. Knocks back any players caught in it.",
              "Type": 2
            },
            {
              "Name": "Impact Roar",
              "Description": "Summons the Hecatoncheir Adds. Can be stunned.",
              "Type": 7
            },
            {
              "Name": "Power Attack",
              "Description": "Targets a random player with an AoE. Anyone caught in it will be afflicted with a dispelable Slow debuff.",
              "Type": 2
            },
            {
              "Name": "Hecatoncheir Adds",
              "Description": "Spawns 1-2 adds that will fixate on a random player. Should be killed quickly.",
              "Type": 7
            }
          ]
        }
      ]
    }
  ]
}
