{
  "Version": 1,
  "Name": "Cutter's Cry",
  "Difficulty": 0,
  "Type": 0,
  "Expansion": 0,
  "Level": 38,
  "UnlockQuestID": 66457,
  "TerritoryIDs": [170],
  "Sections": [
    {
      "Type": 0,
      "Name": "Myrmidon Princess",
      "Phases": [
        {
          "Strategy": "At around 50%% HP Myrmidon Princess will summon 3 types of adds. The recommended add-kill priority is: Myrmidon Marshal first (can cast an ability that heals Myrmidon Princess), Myrmidon Guard second, and Myrmidon Soldiers last.",
          "Mechanics": [
            {
              "Name": "Mandible Bite",
              "Description": "Frontal cone AoE attack",
              "Type": 2
            },
            {
              "Name": "Silence",
              "Description": "Silences one party member",
              "Type": 6
            },
            {
              "Name": "Haste",
              "Description": "Increases the attack speed of adds",
              "Type": 10
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Giant Tunnel Worm",
      "Phases": [
        {
          "Strategy": "Throughout the fight, Giant Tunnel Worm will submerge underneath the sandy grounds of the boss room. The Worm is the most dangerous when it is submerged. Spreading out when the worm submerges reduces the chance that multiple party members will be hit when it emerges from the sand. It is important that after it does the Bottomless desert that adventurers move out of the center to not get hit when the worm emerges.",
          "StrategyShort": "Spread out when the worm submerges to avoid reduces chance that multiple party members will be hit when it emerges. It is important to not stand in the center when the worm does Bottomless desert.",
          "Mechanics": [
            {
              "Name": "Sandstorm",
              "Description": "Instant frontal attack that deals a small amount of damage.",
              "Type": 9
            },
            {
              "Name": "Sand Cyclone",
              "Description": "Targets a random party member, does damage and inflicts a damage over time debuff.",
              "Type": 6
            },
            {
              "Name": "Sand Pillar",
              "Description": "Used when burrowed, damages any player standing on top of the sand trap",
              "Type": 2
            },
            {
              "Name": "Earthbreak",
              "Description": "Used when burrowed explodes out of the ground and heavily damages anyone near it.",
              "Type": 2
            },
            {
              "Name": "Bottomless Desert",
              "Description": "Used when burrowed, appears as a whirlwind on the ground, does damage and pulls all party members towards its center.",
              "Type": 4
            },
            {
              "Name": "Sludge",
              "Description": "Inflicts a DoT (~200 HP per tick) on a random player.",
              "Type": 6
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Chimera",
      "Phases": [
        {
          "Strategy": "Occasionally Chimera will use the abilities Ram's Breath and Dragon's Breath. Ram's Breath causes Ice damage and the heavy debuff on the right side of its body and Dragon's Breath causes Thunder damage and the paralysis debuff on the left side of its body. DPS & Healers can stand directly behind Chimera to avoid these cones. Most of Chimera's attacks will paralyze its target, which can be cleansed with Esuna.\n\nAt 75%% HP, the Chimera will begin to use two attacks called Dragon's Voice and Ram's Voice. When Chimera casts Dragon's Voice all players should move close to the boss to avoid damage. When Chimera casts Ram's Voice all players should move away from Chimera to avoid damage.",
          "StrategyShort": "Ram's Breath (right side) and Dragon's Breath (left side) cause Ice and Thunder damage respectively.\n\nAt 75%% HP, the Chimera will begin to use two attacks called Dragon's Voice and Ram's Voice. When Chimera casts Dragon's Voice all players should move close to the boss to avoid damage. When Chimera casts Ram's Voice all players should move away from Chimera to avoid damage.",
          "Mechanics": [
            {
              "Name": "Ram's Breath",
              "Description": "Deals ice damage and inflicts the heavy debuff on the right side of its body.",
              "Type": 2
            },
            {
              "Name": "Dragon's Breath",
              "Description": "Deals thunder damage and inflicts the paralysis debuff on the left side of its body.",
              "Type": 2
            },
            {
              "Name": "Dragon's Voice",
              "Description": "AoE damage in a ring away from the boss.",
              "Type": 2
            },
            {
              "Name": "Ram's Voice",
              "Description": "AoE damage in a circle close to the boss.",
              "Type": 2
            },
            {
              "Name": "Cacophony",
              "Description": "Purple ball that moves towards a target and explodes. Deals splash damage and inflicts Paralysis.",
              "Type": 6
            },
            {
              "Name": "Ram's Keeper",
              "Description": "Ice orb that flies to a random player. Inflicts Deep Freeze and leaves an icy patch at the hit location.",
              "Type": 6
            }
          ]
        }
      ]
    }
  ]
}
