{
  "Version": 1,
  "Name": "Dzemael Darkhold",
  "InternalName": "DzemaelDarkhold",
  "Difficulty": 0,
  "Type": 0,
  "Expansion": 0,
  "Level": 44,
  "UnlockQuestID": 66515,
  "TerritoryIDs": [
    171
  ],
  "Sections": [
    {
      "Type": 0,
      "Name": "All-seeing Eye",
      "Phases": [
        {
          "Strategy": "Fight the All-seeing Eye near the glowing crystal clusters to gain the Crystal Veil buff. When \"The power of the crystal begins to dim\" appears on screen, move to a new crystal cluster immediately. The All-seeing Eye is invulnerable to attack except when it is near a cluster of crystals.",
          "StrategyShort": "Fight near the glowing crystal clusters to do damage to the All-seeing Eye.",
          "Mechanics": [
            {
              "Name": "Dread Gaze",
              "Description": "Frontal AoE attack that inflicts the Paralysis debuff",
              "Type": 2
            },
            {
              "Name": "Cursed Gaze",
              "Description": "Frontal AoE attack that inflicts the Amnesia debuff",
              "Type": 2
            },
            {
              "Name": "Eyes on Me",
              "Description": "Deals damage all players near the All-seeing Eye. Players under the effect of Crystal Veil are immune to this damage.",
              "Type": 2
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Taulurd",
      "Phases": [
        {
          "Strategy": "He has some powerful AoE cone attacks that should be avoided by all players. Throughout the fight he will summon adds named Deepvoid Slaves. These monsters are on top of an elevated platform. They will perform ranged attacks at the players. Be sure to spread out and avoid their Firewater attacks.",
          "Mechanics": [
            {
              "Name": "Straight Punch",
              "Description": "Instant melee attack that deals a small amount of damage.",
              "Type": 0
            },
            {
              "Name": "Double Smash",
              "Description": "Frontal AoE cone attack that deals a large amount of damage.",
              "Type": 2
            },
            {
              "Name": "Elbow Drop",
              "Description": "Frontal AoE cone attack that deals large amount of damage. Used when under 50% HP.",
              "Type": 2
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Batraal",
      "Phases": [
        {
          "Strategy": "Batraal is the final boss of Dzemael Darkhold. This demon has an instant frontal AoE cone attack that deals heavy damage to all targets hit. Be sure to have only the tank face the boss. He has has a long ranged AoE column attack named Desolation that does extremely high damage and will instantly kill most players. Throughout the fight, a purple beam will appear between Batraal and a crystal. Batraal will mark a player with a crosshair and fires Desolation at the target. While Batraal is connected to the crystal, he is invulnerable. Be sure to kill the crystal as soon as possible while dodging Desolations. The player who was targeted should avoid aiming the Desolations at the rest of the party. At around 30% HP and after the 3rd crystal is destroyed, Batraal will use Hellssend and become enraged. He will start using Desolation at will. Batraal will also spawn black pools under 3 players. Players within the pool will take damage over time. Move out of them immediately. The puddles will occasionally explode and deal high damage to anyone standing in them.",
          "StrategyShort": "Destroy the crystals that are linked with the purple beam immediately to do damage to Batraal. Avoid standing with the party if you are targeted by Desolation.",
          "Mechanics": [
            {
              "Name": "Grim Fate",
              "Description": "Instant attack that deals heavy damage to a single player.",
              "Type": 0
            },
            {
              "Name": "Grim Cleaver",
              "Description": "Instant ranged attack that deals damage to a random player.",
              "Type": 6
            },
            {
              "Name": "Grim Halo",
              "Description": "Instant attack that deals moderate damage to all players around.",
              "Type": 2
            },
            {
              "Name": "Desolation",
              "Description": "AoE column that deals very heavy damage to all players caught within.",
              "Type": 2
            }
          ]
        }
      ]
    }
  ]
}
