{
  "Version": 1,
  "Name": "Halatali",
  "Difficulty": 0,
  "Type": 0,
  "Expansion": 0,
  "Level": 20,
  "UnlockQuestID": 66233,
  "Sections": [
    {
      "Type": 0,
      "Name": "Firemane",
      "Phases": [
        {
          "Strategy": "Summons wisps as adds. The wisps travel toward the fire pit in the center of the boss room. If they reach the pit, they will explode and deal damage to everyone in your party."
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Thunderclap Guivre",
      "Phases": [
        {
          "Strategy": "During this boss fight, Guivre will become invulnerable twice. They spawn lightning elementals while invulnerable. Kill the elementals and the drake will become vulnerable again. Occasionally the water will glow purple; any players standing in the water will take Electrocution damage over time. It is in a shallow pool of water. Those in the water will take significantly more damage from the lightning attacks, so it is advised to fight on either of the slopes. During both add phases, it will run back into the pool to spawn the elementals which will approach the party.",
          "Mechanics": [
            {
              "Name": "Levinshower",
              "Description": "Frontal AoE cone",
              "Type": 2
            },
            {
              "Name": "Electrify",
              "Description": "Non-self-centered AoE attack",
              "Type": 2
            }
          ]
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Pit Peiste (Optional)",
      "Phases": [
        {
          "Strategy": "Pit Peiste is an optional boss with Rudius Beaks as adds."
        }
      ]
    },
    {
      "Type": 0,
      "Name": "Tangata",
      "Phases": [
        {
          "Strategy": "Tangata, the giant ox-like creature, is the final boss of Halatali. During the fight, Tangata will periodically become invulnerable in a pool of lava. While invulnerable, they summon wisps and fire sprites. Wisps will travel toward Tangata and explode if they reach them. Fire sprites will attack your party members. Kill the adds and Tangata will become vulnerable again."
        }
      ]
    }
  ]
}
