{
  "Version": 1,
  "Name": "Sastasha",
  "InternalName": "SastashaHard",
  "Difficulty": 1,
  "Type": 0,
  "Expansion": 0,
  "Level": 50,
  "UnlockQuestID": 65630,
  "TerritoryIDs": [
    387
  ],
  "Sections": [
    {
      "Type": 0,
      "Name": "Karlabos",
      "Phases": [
        {
          "Strategy": "Healers should be ready to dispel the Slime debuff as soon as it is applied to party members or anyone hit by Tail Screw will die.\n\nTail Screw will bring the targeted player down to 1HP - be ready to heal them immediately after.\n\nTethered players are about to be stunned - run into a different teammate if you need to avoid being stunned and the tether will attach to them instead.",
          "Mechanics": [
            {
              "Name": "Impale",
              "Description": "This attack hits the primary threat target for moderate damage - shield and heal as necessary.",
              "Type": 0
            },
            {
              "Name": "Slime & Tail Screw",
              "Description": "The boss will target a random player and hit them with Tail Screw, bringing their health down to 1HP - healers be ready to top this player off.\nDuring the fight, players will accrue the Slime debuff - if a player with Slime is hit by Tail Screw, they will die - healers dispel Slime as soon as possible.",
              "Type": 6
            },
            {
              "Name": "Prey",
              "Description": "The boss will tether to a player and begin to follow them around - eventually the attack will stun the player for a time.\nThis attack can be passed to another team member by running into them - the boss's tether will pass to them, freeing the original player from being stunned.",
              "Type": 6
            }
          ]
        },
        {
          "Type": 0,
          "Name": "Captain Madison",
          "Phases": [
            {
              "Strategy": "Captain's Slave adds will latch onto players and stun them, preventing them from DPSing the boss during In the Line of Fire - kill these adds first.\n\nThe only way to stop the boss when he's attacking with In the Line of Fire is to damage him by a certain amount.",
              "Phases": [
                {
                  "Name": "Captain's Crew",
                  "Description": "These adds should be picked up and removed as quick as possible - prioritize Slaves and Leechs as they stun players and heal the boss respectively.\n\nCaptain's Boy & Captain's Guard\n\tThese are generic adds that can be burned down as quick as possible.\n\nCaptain's Leech\n\tThis add will heal the boss - kill it as soon as possible.\n\nCaptain's Slave\n\tThis add will latch onto a player and stun them until it is killed - prioritize these to avoid lowering group DPS.",
                  "Type": 7
                },
                {
                  "Name": "Hornswaggle",
                  "Description": "This attack hits the primary threat target for moderate damage - shield and heal as necessary.",
                  "Type": 0
                },
                {
                  "Name": "Keelhaul",
                  "Description": "This is a wide frontal cleave - keep the boss facing away from the group at all times.",
                  "Type": 6
                },
                {
                  "Name": "In the Line of Fire",
                  "Description": "The boss will target a single player and begin to shoot them - the only way to stop him is to damage him by a certain amount - all players should stop and focus the boss when he uses this attack to minimize damage.",
                  "Type": 2
                }
              ]
            }
          ]
        },
        {
          "Type": 0,
          "Name": "Kraken",
          "Phases": [
            {
              "Strategy": "Focus on killing Kraken's Arm adds to stun the boss for free time to damage him - ignore Arm adds with the Determination buff.",
              "Mechanics": [
                {
                  "Name": "Limbs",
                  "Description": "Ignore Tentacles and focus on killing Kraken's Arms to eventually stun the boss.\n\nIgnore Arm adds with the Determination buff, as it's a waste of time to kill them.\n\nTentacle\n\t1 of 2 types of adds during this fight, these adds will grab and stun players if they get too close - stand far away and ignore these otherwise.\n\nKraken's Arm\n\tKilling all of these adds will stun the boss, providing free time to damage him.\n\tWhen these adds spawn with a Determination buff, ignore them, as they soak time and take forever to kill - damage the boss instead.",
                  "Type": 7
                },
                {
                  "Name": "Ink Jet",
                  "Description": "This attack covers a large portion of the arena directly in front of the boss - tanks can soak damage from this attack but it will afflict them with a Blind debuff.",
                  "Type": 2
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
