{
  "Version": 1,
  "Name": "The Sunken Temple of Qarn",
  "Difficulty": 1,
  "Type": 0,
  "Expansion": 0,
  "Level": 50,
  "UnlockQuestID": 65632,
  "TerritoryIDs": [367],
  "Sections": [
    {
      "Type": 1,
      "Name": "Damaged Adjudicator",
      "Phases": [
        {
          "Strategy": "There will be 3 Glowing Core phases before you can finish off the boss' body.\n\nThe phase won't push if you kill the wrong Body Part. Make sure you're targeting the Glowing Core one.",
          "Mechanics": [
            {
              "Name": "Body Parts",
              "Description": "The Head, Tail, and Arm of the Adjudicator will be vulnerable to attack. However, only one of the parts will temporarily down him: the one with the Glowing Core.",
              "Type": 5
            },
            {
              "Name": "Glowing Core",
              "Description": "Each time the boss reassembles itself, one of the Body Parts will glow with a bright red orb for a few seconds before fading. Target that part to break the boss apart and move to the next part.",
              "Type": 5
            },
            {
              "Name": "Dust to Dust",
              "Description": "Targets a random player with a large orange arrow marker. after a short time, a sand ball will spawn on top of that player and remain there for some time, pulsing out large AoEs that deal moderate damage.",
              "Type": 2
            },
            {
              "Name": "Shifting Sands",
              "Description": "Spawns an extra large AoE puddle on the ground (generally centered on a player) that will slowly suck you into the sand. If you stay in it for more than ~10 seconds, you will die.",
              "Type": 2
            },
            {
              "Name": "Adds",
              "Description": "After breaking the correct Body Part, the boss will collapse and spawn numerous adds. Kill them ASAP to make the boss stand back up again.",
              "Type": 7
            },
            {
              "Name": "Sandblast",
              "Description": "Unmarked frontal cone AoE on the MT. Keep facing away from the group.",
              "Type": 9
            }
          ]
        }
      ]
    },
    {
      "Type": 1,
      "Name": "Sabotender Emperatriz",
      "Phases": [
        {
          "Strategy": "Make sure to kill the Sabotender Guardia right away so you can attack the boss to cancel 100,000 Needles.",
          "Mechanics": [
            {
              "Name": "100,000 Needles",
              "Description": "Long cast time that is only interupted through damage. If not interupted, instant wipe. Burn the boss ASAP to prevent this. Be sure to kill the tethered Sabotender Guardia so you can cancel this skill.",
              "Type": 8
            },
            {
              "Name": "3,000 Needles",
              "Description": "Targets a random player for a large AoE circle.",
              "Type": 2
            },
            {
              "Name": "Adds",
              "Description": "Will spawn waves of adds throughout the fight. You can either collect and kite them around, have the tank hold them, or kill them. There are a few adds you need to keep an eye out for\n\nSabotender Campeador\n\tExtra large sabotender wielding a large club. Targets the healer and should be killed quickly.\n\nSabotender Guardia\n\tSimilar appearance to the Campeador. However, will immediately use a version of cover on the boss as it begins to cast 100,000 Needles. Must be killed ASAP before you can begin damaging the boss.",
              "Type": 7
            }
          ]
        }
      ]
    },
    {
      "Type": 1,
      "Name": "Vicegerent To The Warden",
      "Phases": [
        {
          "Strategy": "If the tank gets Mummified, the boss will pick a new target until they are unmummified.\n\nAnyone who gets mummified will have to wait until the next round of Mummy Walls, which can take quite a while.\n\nThink of the room as a 3x3 rectangle to figure out where to move for the Mummy Walls.",
          "Mechanics": [
            {
              "Name": "Curse of the Mummy",
              "Description": "A stacking debuff applied through most of the abilities used by the boss. Reaching a stack of 4 will Mummify you.",
              "Type": 10
            },
            {
              "Name": "Mummify",
              "Description": "After getting 4 Curse of the Mummy' stacks, the player will lose control and run to a sarcophagus at one of the four corners of the room. When the next Mummy Walls comes up, the player will run diagonally across the room with the other mummies before returning to normal. Any players hit during this run or who were standing in the sarcophagus will gain increasing stacks of Curse of the Mummy.",
              "Type": 10
            },
            {
              "Name": "Mummy Walls",
              "Description": "Two rows of sarcophagi will appear around the room with a reddish black puddle beneath them. After a few seconds, mummies will run out of the sarcophagi and in a straight line across the room where they will disappear. Anyone standing in the puddle or in the path of the mummies will gain increasing stacks of Curse of the Mummy. ",
              "Type": 2
            },
            {
              "Name": "Light of Anathema",
              "Description": "Targets a random player and turns to them, crossing its blades that are now glowing purple. After a few seconds, it will slice outwards with them, leaving a long line AoE in a straight line before him. Applies stacks of Curse of the Mummy. Often used multiple times in a row.",
              "Type": 2
            },
            {
              "Name": "Flurry of Rage",
              "Description": "Targets a random player for a frontal cleave. Applies stacks of Curse of the Mummy.",
              "Type": 9
            },
            {
              "Name": "Mummy Tether",
              "Description": "The boss will tether to a random player and walk towards them, applying stacks of Curse of the Mummy. Players should stun the boss and the affected player should immediately sprint away from the boss to break the tether.",
              "Type": 6
            }
          ]
        }
      ]
    }
  ]
}
