{
  "Version": 0,
  "Name": "The Wanderer's Palace",
  "Difficulty": 0,
  "Type": 0,
  "Expansion": 0,
  "Level": 50,
  "UnlockQuestID": 66406,
  "TerritoryIDs": [159],
  "Bosses": [
    {
      "Name": "Keeper of Halidom",
      "Strategy": "Everyone - Be prepared to move out of *Inhale. If caught you will take unavoidable damage from the following attack.\n- Also be vigilant of the targetted AOE *Moldy Phlegm, prepare to run away.\n\nTank - Bring the boss to the back wall and make him face away from the party.\n\nHealer - Make sure you *Esuna the *Reduced Immunity & Poison Debuff from the party.\n\nDPS - Do damage & try not to get hit.",
      "Mechanics": [
        {
          "Name": "Beatdown",
          "Description": "Instant frontal melee attack - Small amount of damage.",
          "Type": 6
        },
        {
          "Name": "Moldy Sneeze",
          "Description": "Instant frontal attack - Moderate amount of damage.\n\n*Also inflicts a Healing Debuff (Healing Recieved) to all players hit.",
          "Type": 9
        },
        {
          "Name": "Inhale",
          "Description": "Large frontal AOE cone that will pull you into their melee range. Immediately followed up by *Goobbue's Grief. ",
          "Type": 2
        },
        {
          "Name": "Goobbue's Grief",
          "Description": "Instant AOE - Moderate amount of damage.\n\n*Also inflicts a Poison Debuff to all that are in melee range.",
          "Type": 2
        },
        {
          "Name": "Moldy Phlegm",
          "Description": "Large AOE attack that targets a random player - Moderate amount of damage.\n\n*Also inflicts a Healing Debuff (Healing Recieved) to all players hit.",
          "Type": 2
        }
      ]
    },
    {
      "Name": "Giant Bavarois",
      "Strategy": "Everyone - Occasionally, the boss will target a random player, followed by using *Amorphic Flail if allowed to get close. Targetted player should run away from the boss.\n- Periodically adds spawn throughout the fight. *Blue Bavarois should be dealt with first, followed by the rest.\n\nTank - Keep the boss facing away from the party. Also be mindful of the party when adds spawn. When the boss casts *Fire either interrupt or move behind the boss.\n\nHealer - Make sure you *Esuna the debuffs off the party.  *Most detrimental are: Heavy & Paralysis\n\nDPS - Be prepared for add spawns. Priority is: Blue, Purple, White, Green.",
      "Mechanics": [
        {
          "Name": "Fire",
          "Description": "Spell - Moderate amount of damage.",
          "Type": 6
        },
        {
          "Name": "Amorphic Flail",
          "Description": "Attack - Large amount of damage to the targetted player.",
          "Type": 6
        },
        {
          "Name": "*Periodic add spawns",
          "Description": "White Bavarois: Casts Blizzard spell - Small amount of damage & inflicts the *Heavy debuff.\n\nBlue Bavarois: Casts Water spell - Small amount of damage.\n\nGreen Bavarois: Casts Aero spell - Small amount of damage & inflicts the *Windburn debuff.\n\nPurple Bavarois: Casts Thunder spell - Small amount of damage & inflicts the *Paralysis debuff",
          "Type": 7
        }
      ]
    },
    {
      "Name": "Tonberry King",
      "Strategy": "Everyone - When a Tonberry add dies it gives the boss a stack of *Rancid increasing the damage of *Everybody's Grudge. We want to minimise this. So only kill the small Tonberrys if necessary. Dont attack the larger Tonberry Slashers. Instead, focus on putting the boss down ASAP.\n\nTank - Keep the boss in the center of the room, facing away from the party. *Always stay in melee range of the boss.\n\nHealer - Make sure you *Esuna the *Heavy debuff from the party. Potential high damage output on the tank/party. Prepare.\n\nDPS - Kill the small Tonberrys when necessary, but dont attack the larger Tonberry Slashers. Instead focus on putting down the boss ASAP.",
      "Mechanics": [
        {
          "Name": "Lateral Slash",
          "Description": "Instant melee attack - Small amount of damage.",
          "Type": 6
        },
        {
          "Name": "Whetstone",
          "Description": "Instant ability - Gives the boss the *Sharpened knife buff, increasing the damage that *Lateral slash deals",
          "Type": 10
        },
        {
          "Name": "Scourge of Nym\n(Target outside\nof melee range)",
          "Description": "Ranged attack - Large amount of damage.\n\n*Also inflicts Heavy debuff.",
          "Type": 0
        },
        {
          "Name": "Everybody's Grudge",
          "Description": "Attack that deals scaling damage based on *Rancor stacks.",
          "Type": 0
        }
      ]
    }
  ]
}
