{
    "Version": 0,
    "Name": "Aglaia",
    "Difficulty": 0,
    "Type": 2,
    "Expansion": 4,
    "Level": 90,
	"UnlockQuestID": 70073,
	"Bosses": [
		{
			"Name": "Byregot",
			"Strategy": "This fight consists of two separate, alternating phases. \n\nIn the first phase the arena has a square shape, and the boss will mostly do AoE type attacks. You cannot fall off during this phase. \n\nIn the second phase the arena transforms into a 3x5 grid of blocks without a fence, so players can fall off. Byregot will summon hammers at the sides of the arena in regular intervals which knock away the floor blocks by 1 tile after 15 seconds. This will always happen shortly before other mechanics go off. \nMake sure not to stand on a tile that will be knocked away, or else you will lose your footing and fall to your death.",
			"Mechanics": [
				{
					"Name": "Byregot's Ward",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Ordeal of Thunder",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Byregot's Strike",
					"Description": "Knockback from a blue AoE.",
					"Type": 2
				},
				{
					"Name": "Builder's Build",
					"Description": "Like Byregot's Strike, but with 4 cone-shaped AoEs that will go off from the middle of the blue area like a cross.",
					"Type": 2
				},
				{
					"Name": "Levinforge",
					"Description": "A purple hammer that creates a line AoE, and can be pushed around together with the floor, when it's knocked by a hammer.\nPlayers must predict the movement of the purple hammer while making sure not to have the ground fall beneath their feet.",
					"Type": 2
				},
				{
					"Name": "Byregot's Spire",
					"Description": "The boss will jump to one side and start casting a wide line AoE in the center 3 columns.\nHammers will knock around the floor just before the cast goes off.\nPlayers must predict where the blocks will be knocked, and run to a block that is knocked out of Byregot's AoE.",
					"Type": 10
				},
				{
					"Name": "Reproduce",
					"Description": "5 clones of the boss appear at one side of the arena, casting Cloud to Ground, a circle AoE that will travel to the opposite side.\nThe AoEs from clones with lightning around them travel faster.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Rhalgr's Emissary",
			"Strategy": "Rhalgr's Emissary is a simple miniboss with a small amount of AoE type mechanics.",
			"Mechanics": [
				{
					"Name": "Destructive Strike",
					"Description": "Cleave & Tankbuster",
					"Type": 0
				},
				{
					"Name": "Bolts from the Blue",
					"Description": "Moderate raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Destructive Static",
					"Description": "Half room AoE on the side the miniboss is holding his axe.",
					"Type": 2
				},
				{
					"Name": "Lightning Bolt",
					"Description": "Two moving bolts of lightning will draw a shape on the floor. \nDon't stand inside the encircled area.",
					"Type": 2
				},
				{
					"Name": "Boltloop",
					"Description": "Two circle AoEs will appear on opposite sides of the arena, followed by an expanding donut AoE.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Rhalgr",
			"Strategy": "The main themes of this fight are paying attention to the rings floating around the boss, which are portals for his punches, as well as avoiding to get knocked off the platform.",
			"Mechanics": [
				{
					"Name": "Lightning Reign",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Advent of the Eighth",
					"Description": "Two of the bosses rings will turn into giant portals, connected to the other two rings that remain with him. He will then punch into one of them, resulting in a gigantic fist coming out of the corresponding portal.\nThe portal from which his fist spawns can be predicted by which ring he punches and a particle effect traveling from the small ring to the large portal.",
					"Type": 2
				},
				{
					"Name": "Broken World",
					"Description": "Proximity based AoE damage in the form of a meteor. \n\nIf this attack is used at the same time as Advent of the Eighth, watch out from which portal his fist will come out. If the portal is on the same side as the proximity AoE, the safe zone is where the proximity AoE originally appeared.",
					"Type": 2
				},
				{
					"Name": "Rhalgr's Beacon",
					"Description": "Knockback AoE with 5 green arrow lines indicating where you will be knocked to. Stand on a line that goes up one of the fingers, as those will stop the knockback. \n\nHell of Lightning: \nPlaces purple lightning orbs on some of the fingers, which should be avoided when deciding where to be knocked back into.",
					"Type": 10
				},
				{
					"Name": "Bronze Work",
					"Description": "Two sets of thin conal AoEs will appear from the boss. Stand in the second cone AoE and then move out of it when the first one goes off.",
					"Type": 2
				},
				{
					"Name": "Destructive Bolt",
					"Description": "Tankbuster on all 3 tanks.",
					"Type": 0
				}
			]
		},
		{
			"Name": "Lion & Lioness of Aglaia",
			"Strategy": "The main strategy for these minibosses is to kill one of them as fast as possible to massively simplify the mechanics. Typically the lion is killed first, to allow for full melee uptime.",
			"Mechanics": [
				{
					"Name": "Double Immolation",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Slash and Burn",
					"Description": "The lioness will be marked with a donut AoE while the lion will be marked with a circle AoE. The dots above them show the order in which the mechanics resolve.",
					"Type": 2
				},
				{
					"Name": "Roaring Blaze",
					"Description": "Two AoEs, each covering one half of the room. The dots above the lions show the order in which the AoEs resolve.",
					"Type": 2
				},
				{
					"Name": "Roaring Blaze (Only 1 lion left)",
					"Description": "Cleaves only one half of the arena.",
					"Type": 2
				},
				{
					"Name": "Trial by Fire",
					"Description": "Circle AoE in the center of the caster.",
					"Type": 2
				},
				{
					"Name": "Spinning Slash",
					"Description": "Donut AoE in the center of the caster.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Azeyma",
			"Strategy": "In this fight you will have to react to lots of visual cues like mirror images of Azeyma to predict very briefly announced AoEs.",
			"Mechanics": [
				{
					"Name": "Warden's Warmth",
					"Description": "Tankbuster on all 3 tanks.",
					"Type": 0
				},
				{
					"Name": "Warden's Prominence",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Solar Wings",
					"Description": "Two wide cones to the boss's flanks, along with 6 fiery orbs inside the AoE hit that explode afterwards. \n\nSometimes, clones will appear and the boss will cast Haute Air, kicking the orbs in the direction that the clones are facing.",
					"Type": 2
				},
				{
					"Name": "Solar Fans",
					"Description": "Two fans will start from the boss and move to opposite walls with a line AoE trailing behind them. \n\nRadiant Rhythm: \nThe fans will repeatedly move 90 degrees around the edge of the arena. \n\nRadiant Finish: \nBoth fans will explode in two massive circle AoEs.",
					"Type": 2
				},
				{
					"Name": "Solar Fold",
					"Description": "The arena will be divided into four quadrants with bars of flame separating them. \n\nSun's Shine: \nClones will appear in some of the quadrants, looking towards one of the bars. The clones will wave their fans, blowing wind towards the bars, spreading the fire over the entire quadrant behind it.",
					"Type": 2
				},
				{
					"Name": "Fleeting Spark",
					"Description": "A large 270 degree cleave to the boss' front and flanks.",
					"Type": 9
				},
				{
					"Name": "Wildfire Ward",
					"Description": "A large portion of the arena will be covered in flame, leaving only a triangle in the center safe. Three knockback lines will then appear in sequence. Players must memorize the sequence that they appear in and position themselves to not get knocked into the fire.",
					"Type": 10
				},
				{
					"Name": "Noble Dawn",
					"Description": "A flaming ball will appear in the center and highlight random areas for fiery circle puddles, which then expand into a medium circle AoE. \n\nSublime Sunset: \nAzeyma positions herself to kick the flaming ball into one side of the map, placing a proximity AoE at the spot where it will land.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Nald'thal",
			"Strategy": "The main gimmick of this fight is that the boss will switch between his Nald and Thal faces to alternate his mechanics.\nOrange mechanics will go off when Nald's face is active, the floating chandelier-shaped objects and the skybox are glowing orange. Blue mechanics will go off when Thal's face is active, the floating chandelier-shaped objects and the skybox are glowing blue.",
			"Mechanics": [
				{
					"Name": "Golden Tenet",
					"Description": "Stack tankbuster.",
					"Type": 0
				},
				{
					"Name": "Stygian Tenent",
					"Description": "Tankbuster on all 3 tanks.",
					"Type": 0
				},
				{
					"Name": "As Above, So Below",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Hells' Trial",
					"Description": "Heavy, unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Heat Above, Flames Below",
					"Description": "Orange mechanic: a circle AoE around the boss.\nBlue mechanic: a large donut AoE around the boss.\nStand outside of the indicated colour.",
					"Type": 2
				},
				{
					"Name": "Heavens' Trial",
					"Description": "Three unavoidable conal AoEs on three random players and a stack marker on a fourth random player.",
					"Type": 2
				},
				{
					"Name": "Far Above, Deep Below",
					"Description": "Orange mechanic: a line stack AoE.\nBlue mechanic: three players get marked with a chaser AoE.\nOnly the mechanic indicated by the colour goes off.",
					"Type": 2
				},
				{
					"Name": "Once Above, Ever Below",
					"Description": "Blue and orange traveling AoE indicators form a cross. Only the ones indicated by the colour go off. \nStand inside the quadrant enclosed by the opposite colour.",
					"Type": 2
				},
				{
					"Name": "Hell of Fire",
					"Description": "Half room AoE on the side Nald is facing, no matter which face is currently active. The boss may rotate his body, swapping the side of the AoE.",
					"Type": 2
				},
				{
					"Name": "Wayward Soul",
					"Description": "Large balls fall down, resulting in massive circle AoEs. First in sets of 3, then in a spiral pattern forcing players to move around the boss.",
					"Type": 2
				},
				{
					"Name": "Fired Up",
					"Description": "Boss will mark spots he will jump towards. An icon above those spots indicates whether it's a circle AoE or a knockback.",
					"Type": 2
				},
				{
					"Name": "Soul's Measure",
					"Description": "Boss summons 3 adds. \n\nTwingaze: \nThin cone AoE targeting a random player. \nMagmatic Spell: \nThree stack markers that should be taken separately by each alliance.",
					"Type": 7
				},
				{
					"Name": "Tipped Scale",
					"Description": "Arena is split in half and a pair of scales appears in the middle. Players must split up across both halves to balance out the scales. Each player counts as 1 weight and the dead adds weigh either 2 or 3. \nIf the scales are balanced, the entire alliance receives a permanent damage up buff and each alliance's Limit Break bar is fully charged. If not, it will trigger a wipe.",
					"Type": 10
				}
			]
		}
	]
}