{
    "Version": 0,
    "Name": "The Stigma Dreamscape",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 90,
    "UnlockQuestID": 69704,
    "TerritoryIDs": [970],
    "Bosses": [
		{
			"Name": "Proto-Omega",
			"Strategy": "This fight consists mainly of several large AoEs that need to be anticipated.",
			"Mechanics": [
				{
					"Name": "Side Cannons",
					"Description": "Half room AoE indicated by the arrows on the side of the boss.",
					"Type": 2
				},
				{
					"Name": "Rear/Forward Interceptors",
					"Description": "Half room AoE in front or behind the boss, indicated by the cast name.",
					"Type": 2
				},
				{
					"Name": "Chemical Missile",
					"Description": "Circle AoEs on every non-tank player that leave behind a damage over time puddle.",
					"Type": 6
				},
				{
					"Name": "Electric Slide",
					"Description": "Party stack that knocks everyone back from the targeted player on hit.",
					"Type": 3
				},
				{
					"Name": "Guided Missile",
					"Description": "Spawns missiles that tether to players and follow them until they make contact, resulting in circle AoEs that leave behind damage over time puddles.",
					"Type": 6
				},
				{
					"Name": "Mustard Bomb",
					"Description": "Tankbuster.",
					"Type": 0
				}
			]
		},
		{
			"Name": "Arch-Lambda",
			"Strategy": "This boss dashes a lot through the arena. Players also have to watch out for dot markers above their heads and position themselves in order.",
			"Mechanics": [
				{
					"Name": "Wheel",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Atomic Flame",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Auto-mobile Assault Cannon",
					"Description": "The boss moves to the middle of the room, followed by a set of back to back line AoEs along which he moves",
					"Type": 2
				},
				{
					"Name": "Wave Cannon",
					"Description": "Half room AoE in front of the boss. Always used immediately after Auto-mobile Assault Cannon",
					"Type": 2
				},
				{
					"Name": "Auto-mobile Sniper Cannon",
					"Description": "Boss moves to the edge and indicates a line AoE along which he will dash soon. Number dots will appear both above the heads of the players and along the line AoE indicating the order in which players will get hit with line AoEs while the boss dashes through the middle.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Stigma-4",
			"Strategy": "Players need to pay attention to the adds the boss spawns as well as the shapes the boss transforms into, especially when they're about to be forced to run into a specific direction after Mindhack.",
			"Mechanics": [
				{
					"Name": "AI Takeover",
					"Description": "The boss spawns one of three possible adds:\n\nOmega Frame:\nUses Proto-wave Cannon, a half room cleave, as well as Self-Destruct which deals unavoidable raidwide damage if not killed before the cast finishes.\n\nHybrid Dragon:\nUses Firebreath, a wide cone AoE, as well as Self-Destruct, just like the Omega Frame.\n\nProto-Rocket Punch:\nSpawns six fist shaped adds on the edge of the arena that will cast Rush and dash through the arena in line AoEs.",
					"Type": 10
				},
				{
					"Name": "Multi-AI Takeover",
					"Description": "Spawns two of the AI Takeover adds at the same time.",
					"Type": 10
				},
				{
					"Name": "Atomic Ray",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Electromagnetic Release",
					"Description": "The boss transforms into one of two possible shapes. If he transforms into a wide ring of particles he will cast a donut AoE. If he transforms into a helix shaped vertical pillar he will cast a circle AoE around himself.",
					"Type": 4
				},
				{
					"Name": "Mindhack",
					"Description": "Inflicts all players with a Face direction debuff that forces players to run into the direction indicated by the debuff once it runs out.",
					"Type": 0
				}
			]
		}
	]
}