{
    "Version": 0,
    "Name": "The Tower of Zot",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 81,
    "UnlockQuestID": 69913,
    "TerritoryIDs": [952],
    "Bosses": [
        {
            "Name": "Minduruva",
            "Strategy": "After displaying her mechanics this boss will mark areas in the arena from which her further mechanics will go off.",
            "Mechanics": [
                {
                    "Name": "Manusya Bio",
                    "Description": "Tankbuster and damage over time. Can be dispelled with Esuna.",
                    "Type": 0
                },
                {
                    "Name": "Manusya Blizzard III",
                    "Description": "Fires twelve thin, equally spaced cone AoEs into all directions. Stand inbetween them.",
                    "Type": 2
                },
                {
                    "Name": "Manusya Fire III",
                    "Description": "Large donut AoE.",
                    "Type": 2
                },
                {
                    "Name": "Manusya Thunder III",
                    "Description": "Small traveling circle AoEs that travel outwards in a cross shape from their origin point.",
                    "Type": 2
                },
                {
                    "Name": "Manusya Bio III",
                    "Description": "A large AoE that covers the entire area in front of the boss, or the target area facing the middle of the room.",
                    "Type": 2
                },
                {
                    "Name": "Dhrupad",
                    "Description": "Damage over time effect on all non-tanks.",
                    "Type": 6
                }
            ]
        },
        {
            "Name": "Sanduruva",
            "Strategy": "Avoid AoEs as possible. When the boss casts Manusya Stop, spread out around her because each player will be unable to move while she casts her AoE. When she summons her mirror images run to the one that isn't moving at all.",
            "Mechanics": [
                {
                    "Name": "Isitva Siddhi",
                    "Description": "Tankbuster.",
                    "Type": 0
                },
                {
                    "Name": "Prapti Siddhi",
                    "Description": "Line AoE at every player one by one.",
                    "Type": 2
                },
                {
                    "Name": "Manusya Berserk",
                    "Description": "Five orbs appear and explode in AoEs afterwards. Getting hit inflicts the Berserk debuff, which causes the player to uncontrollably run towards the boss and attack her.",
                    "Type": 2
                },
                {
                    "Name": "Prakamya Siddhi",
                    "Description": "Circle AoE around the boss.",
                    "Type": 2
                },
                {
                    "Name": "Manusya Stop",
                    "Description": "Inflicts a debuff on each player that causes stop once it runs out. The boss will cast an unavoidable Prapti Siddhi at each player as their debuffs run out.",
                    "Type": 4
                },
                {
                    "Name": "Manusya Confuse",
                    "Description": "Boss leaps away and lands around the room with five mirror images. Only the one that isn't moving is the boss. The others are Manusya Berserk orbs disguised as the boss.",
                    "Type": 4
                }
            ]
        },
        {
            "Name": "The Magus Sisters",
            "Strategy": "Kill Cinduruva first, as she can revive her sisters. The boss alternates between Delta Attack, which makes Minduruva's mechanics going off from all 3 sisters in a slightly altered version and the 3 sisters casting some of her base mechanics individually.",
            "Mechanics": [
                {
                    "Name": "Samsara",
                    "Description": "Unavoidable raidwide damage.",
                    "Type": 4
                },
                {
                    "Name": "Delta Attack",
                    "Description": "This is a multi-layered mechanic that consists of Minduruva casting one of her spells, Sanduruva casting Manusya Faith which buffs and slightly alters Minduruva's spell, and Cinduruva using Manusya Reflect so Minduruva's spell goes off from all three sisters' hitboxes.\n\nMinduruva's spells are indicated by a text bos that appears on screen:\n\nBlizzard III = Glacial ice, entomb our foes!\nThunder II = Thunderous tempest, smite our foes!\nFire III = Insatiable flame, consume our foes!",
                    "Type": 10
                }
            ]
        }
    ]
}