{
    "Version": 0,
    "Name": "Halatali",
    "Difficulty": 1,
    "Type": 0,
    "Expansion": 0,
    "Level": 50,
    "UnlockQuestID": 66946,
    "TerritoryIDs": [360],
    "Bosses": [
        {
            "Name": "Pyracmon",
            "StrategyShort": "Make sure to stand inside the Mammet Bubble after using the Mammet Activator so you can avoid the damage from 1000-tonze Swing. Only activating the bubble won't save you.",
            "Mechanics": [
                {
                    "Name": "Eye of the Beholder",
                    "Description": "Unmarked 270° cone AoE in the direction the boss is facing. Move behind to avoid.",
                    "Type": 9
                },
                {
                    "Name": "Piercing Glower",
                    "Description": "Unmarked line AoE in the direction of a random player. Sidestep to avoid.",
                    "Type": 2
                },
                {
                    "Name": "100-tonze Swipe",
                    "Description": "Unmarked wide frontal cone AoE that deals moderate damage and knocksback players caught in it. Tank can sidestep or walk through the boss to avoid.",
                    "Type": 9
                },
                {
                    "Name": "100-tonze Swing",
                    "Description": "Unmarked large AoE centered on the boss that deals moderate damage and knocksback players caught in it. Walk back a few steps to avoid.",
                    "Type": 2
                },
                {
                    "Name": "1000-tonze Swing",
                    "Description": "Roomwide AoE where the floor glows blueish purple. Has a long cast time and is fatal if not standing in the Mammet Bubble.",
                    "Type": 4
                },
                {
                    "Name": "Mammet Activator",
                    "Description": "Causes the Admirer Mammet to stop moving and spawn a damage reduction bubble for a short time. The lever will become unusable for a short time after.",
                    "Type": 10
                },
                {
                    "Name": "Admirer Mammet #022A",
                    "Description": "Spawns a Mammet Bubble for a short time after using the Mammet Activator. Used to avoid 1000-tonze Swing.",
                    "Type": 10
                }
            ]
        },
        {
            "Name": "Catoblepas",
            "StrategyShort": "Leave the Shadowy Orbs nearest the boss for the melee classes and have the ranged classes take the further ones.\n\nMake sure to kill the Tainted Eye ASAP so you don't need to deal with the Bestial Roar AoEs longer than necessary.",
            "Mechanics": [
                {
                    "Name": "Eye Phases",
                    "Description": "Various messages will display detailing the color of the boss' eye. The color affects what abilities it will use.\n\tBlue: Uses Cold Stare.\n\tYellow: Uses Demon Eye.\n\tRed: Uses Bestial Roar and spawns a Tainted Eye.",
                    "Type": 10
                },
                {
                    "Name": "Shadowy Orb",
                    "Description": "There are four of these, one on each pedastal, spaced equidistant around the room. Used to avoid Demon Eye. Grants a ~45-second blind debuff on use.",
                    "Type": 10
                },
                {
                    "Name": "Demon Eye",
                    "Description": "Used during Yellow Eye Phase. Has a very long cast and any players caught by it will be turned to stone. Use the Shadowy Orbs to prevent this.",
                    "Type": 4
                },
                {
                    "Name": "Cold Stare",
                    "Description": "Used during Blue Eye Phase. Massive 90° conal AoE directed at a random player. Deals moderate damage and applies a paralysis debuff.",
                    "Type": 2
                },
                {
                    "Name": "Bestial Roar",
                    "Description": "Used repeatedly during Red Eye Phase. A roomwide AoE that deals moderate damage.",
                    "Type": 4
                },
                {
                    "Name": "Jettatura",
                    "Description": "Used in all Eye Phases. Spawns 1-4 eye AoEs beneath random players.",
                    "Type": 2
                },
                {
                    "Name": "Tainted Eye",
                    "Description": "Used during Red Eye Phase. The eye on the front of the boss' face becomes targetable. Should be killed ASAP and will revert the boss to Blue Eye Phase.",
                    "Type": 8
                }
            ]
        },
        {
            "Name": "Mumuepo the Beholden",
            "StrategyShort": "Make sure to interact with the Thal's Scepter to free any trapped players.\n\nIgnore Narasimha until Mumuepo is killed.",
            "Mechanics": [
                {
                    "Name": "Phase 1",
                    "Description": "Starts with four mobs that must be killed, listed in kill order below.\n\nSilent Moss the Solemn\n\tThe Conjurer of the group. Should be killed first as he will heal the others.\n\nLangloisiert the Lionheart\n\tThe Lancer of the group. Should be killed second as he can't be aggroed and deals high damage.\n\nU'linbho the Sand Devil\n\tThe Archer of the gorup. Should be killed third as he deals high damage but can be aggroed.\n\nFranz the Fair\n\tThe Gladiator of the group. Should be killed last as he does little damage.",
                    "Type": 7
                },
                {
                    "Name": "Mumuepo the Beholden",
                    "Description": "Should be killed before Narasimha. Uses Thal's Scepter and ???.",
                    "Type": 7
                },
                {
                    "Name": "Narasimha",
                    "Description": "Should be killed after Mumuepo. The tank should pick it up at the start of the fight, and the group should ignore it until then. Uses Fireball and Tail Swipe.",
                    "Type": 7
                },
                {
                    "Name": "Thal's Scepter",
                    "Description": "Chains 2 players to it with Absolute Bind. Interacting with the scepter will break the bind and allow players to continue moving. Uses ??? during this.",
                    "Type": 10
                },
                {
                    "Name": "???",
                    "Description": "Used during Thal's Scepter. Drops a massive AoE on the platform, often overlapping both of the chained players.",
                    "Type": 2
                },
                {
                    "Name": "Fireball",
                    "Description": "Large AoE on a random player.",
                    "Type": 2
                },
                {
                    "Name": "Tail Swipe",
                    "Description": "Cone AoE from the boss' rear.",
                    "Type": 2
                }
            ]
        }
    ]
}