{
    "Version": 0,
    "Name": "The Final Day",
    "Difficulty": 0,
    "Type": 1,
    "Expansion": 4,
    "Level": 90,
    "UnlockQuestID": 70000,
	"Bosses": [
		{
			"Name": "The Endsinger (Phase 1)",
			"Strategy": "Players must pay attention to the animations of the boss, as these indicate which areas of the arena are hit by mechanics. \nAlso, players must pay attention to the summoned planets that move around the edge of the arena, as they result in massive AoEs when they crash into each other. Furthermore the boss frequently rewinds time to reconstruct planets and let them crash again.",
			"Mechanics": [
				{
					"Name": "Elegeia",
					"Description": "Raidwide, followed by two planets spawning around the arena.\nThese will start orbiting the platform until the faster one crashes into the slower one, resulting in a massive circle AoE.",
					"Type": 2
				},
				{
					"Name": "Galaxias",
					"Description": "Outward knockback from the middle of the platform.",
					"Type": 2
				},
				{
					"Name": "Elenchos",
					"Description": "One of two possible variations of line AoEs.\nEndsinger's mouth glows:\nLine AoE through the middle of the arena.\nEndsinger cries tears:\nTwo line AoEs at the edge of the platform.",
					"Type": 2
				},
				{
					"Name": "Death's Embrace",
					"Description": "Targeted cone AoEs at random players, followed by adds at position where players were hit.\nAdds detonate in circle AoEs after they finish casting Pharmakon.",
					"Type": 6
				},
				{
					"Name": "Aporrhos",
					"Description": "Spawns 4 miniature Endsinger heads that cast line AoEs in the direction they are facing.",
					"Type": 2
				},
				{
					"Name": "Hubris",
					"Description": "Heavy AoE Tankbuster on both tanks.",
					"Type": 0
				},
				{
					"Name": "Elegeia Unforgotten",
					"Description": "Elegeia followed by the planets partially reforming, as the boss partially turns back and freezes time.",
					"Type": 2
				},
				{
					"Name": "Fatalism",
					"Description": "Further rewinds time one planet collision to let them collide once more in another massive AoE.",
					"Type": 2
				},
				{
					"Name": "Ekstasis",
					"Description": "Circle AoEs that grow in size.",
					"Type": 2
				},
				{
					"Name": "Interstellar",
					"Description": "Boss repositions and does a dive attack.\nAt the same time four players get marked with a targeted circle AoE.",
					"Type": 2
				},
				{
					"Name": "Nemesis",
					"Description": "Targeted circle AoE on every player.",
					"Type": 6
				},
				{
					"Name": "Planetes",
					"Description": "Transition into add phase, as Kakodaimon is summoned.",
					"Type": 7
				}
			]
		},
		{
			"Name": "Kakodaimon",
			"Strategy": "This phase is a DPS check. Feel free to use melee Limit Break, as the Limit Gauge will fully charges when the add dies. \nThe add must die before the Despair gauge reaches 100.",
			"Mechanics": [
				{
					"Name": "Meteor Radiant",
					"Description": "Spawns planets on the edge of the platform that will crash in large circle AoEs onto the platform.",
					"Type": 2
				},
				{
					"Name": "Meteor Outburst",
					"Description": "Targeted circle AoE on every player.",
					"Type": 6
				}
			]
		},
		{
			"Name": "The Endsinger (Phase 2)",
			"Strategy": "This phase is just a cinematic finishing struggle sequence. Mechanics are a light healing check and a couple AoEs to avoid.",
			"Mechanics": [
				{
					"Name": "Telos",
					"Description": "Raidwide AoE.",
					"Type": 4
				},
				{
					"Name": "Telomania",
					"Description": "3 mechanics loop consisting of 4 cleaves, followed by a raidwide, followed by 3 sets of puddles spawning below players.\nRepeats until the boss is dead.",
					"Type": 4
				}
			]
		}
	]	
}