{
    "Version": 0,
    "Name": "Alzadaal's Legacy",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 90,
	"UnlockQuestID": 70065,
	"TerritoryID": 1050,
	"Bosses": [
		{
			"Name": "Ambujam",
			"Strategy": "Watch out for AoEs during trash pulls before the first boss.",
			"KeyMechanics": [
				{
					"Name": "Big Wave",
					"Description": "Unavoidable raid wide damage that inflicts Bleed.",
					"Type": 4
				},
				{
					"Name": "Tentacle Dig",
					"Description": "One or both of the large tentacles of the boss are submerged and travel around the arena. They'll resurface in massive circle AoEs a few seconds after stopping to move that also inflict a heavy Toxicosis damage over time debuff.",
					"Type": 2
				},
				{
					"Name": "Toxic Fountain",
					"Description": "Three sets of circle AoEs that explode and knock back in the order they appeared.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Armored Chariot",
			"Strategy": "During trash pulls before the second boss prioritize Alzdaal's Rampart mobs so they stop summoning additional adds.",
			"KeyMechanics": [
				{
					"Name": "Articulated Bits",
					"Description": "Small damage over time puddle in the hitbox of the boss. Additionally 4 adds spawn in each corner. These will be marked with dots, indicating the order in which they fire a laser beam towards the boss. The boss will hold his shields up to reflect and spread the laser beams across the entire quadrant of the adds firing towards him.\nAll adds may fire at the same time. In that case the safe zones are where no beams are firing and outside the quadrants the shields are facing.",
					"Type": 2
				},
				{
					"Name": "Diffusion Ray",
					"Description": "Unavoidable raid wide damage.",
					"Type": 4
				},
				{
					"Name": "Graviton Cannon",
					"Description": "Targeted circle AoEs on each player. Used alongside every other Articulated Bits cast starting from the third.",
					"Type": 6
				},
				{
					"Name": "Rail Cannon",
					"Description": "Tankbuster.",
					"Type": 0
				}
			]
		},
		{
			"Name": "Kapikulu",
			"Strategy": "The last waves of adds before the final boss have no specifics, aside from the usual AoEs that should be avoided.",
			"KeyMechanics": [
				{
					"Name": "Billowing Bolts",
					"Description": "Unavoidable raid wide damage.",
					"Type": 4
				},
				{
					"Name": "Crewel Slice",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Spin Out",
					"Description": "Boss pulls all players towards him, wrapping them in ribbons and activating several spike traps around the arena. The boss unravels the players like spinning tops, causing them to spin uncontrollably around the arena for 10 seconds. Players can roughly steer their character into the direction indicated by the pointing hand icon above their heads.",
					"Type": 10
				},
				{
					"Name": "Blasting Blade",
					"Description": "Wide line AoE fired from the boss. Used twice during Spin Out casts after the first one.",
					"Type": 2
				},
				{
					"Name": "Wild Weave",
					"Description": "Yellow and green ropes fall from the ceiling. Boss tethers to one of them indicating the safe zone. The other ones will drop orbs resulting in large circle AoEs.",
					"Type": 2
				},
				{
					"Name": "Magnitude Opus",
					"Description": "Party stack",
					"Type": 3
				},
				{
					"Name": "Rotary Gale",
					"Description": "Targeted circle AoEs under each player.",
					"Type": 6
				}
			]
		}
	]	
}