{
    "Version": 0,
    "Name": "Ktisis Hyperboreia",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 87,
	"UnlockQuestID": 69973,
	"TerritoryID": 974,
	"Bosses": [
		{
			"Name": "Lyssa",
			"Strategy": "When the boss hides during the snowstorm look towards which crater the footprints lead. That's where the boss will reapper. Stand behind it to avoid the upcoming half room AoE.",
			"KeyMechanics": [
				{
					"Name": "Frigid Stomp",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
			    },
				{
					"Name": "Skull Dasher",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Frostbite and Seek",
					"Description": "Boss casts a snowstorm and becomes invisible. Safe zone is behind the boss. Look where the footprints in the snow end to see at which crater the boss will spawn.",
					"Type": 2
				},
				{
					"Name": "Icicall",
					"Description": "Icicles spawn around the arena casting a circle AoE around them, followed by line AoEs either alon the edges or through the middle of the arena.",
					"Type": 2
				},
				{
					"Name": "Heavy Smash",
					"Description": "Party stack.",
					"Type": 3
				}
			]
		},
		{
			"Name": "Ladon Lord",
			"Strategy": "The three heads of the boss indicate which third of the arena will get hit by his breath mechanics. His left head breathes at the left third behind the boss, his right head at the right third behind him, and his middle head at the third in front of him.",
			"KeyMechanics": [
				{
					"Name": "Scratch",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Intimidation",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Pyric Blast",
					"Description": "Parts stack.",
					"Type": 3
				},
				{
					"Name": "Inhale",
					"Description": "Boss inhales Aether, preparing for one or two of his heads to use Pyric Breath.",
					"Type": 10
				},
				{
					"Name": "Pyric Breath",
					"Description": "Boss leaps to the middle and his swollen heads will fire wide cone shaped AoEs.",
					"Type": 2
				},
				{
					"Name": "Pyric Spheres",
					"Description": "Four Pyric Spheres spawn that will cast cross shaped AoEs across the arena.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Hermes",
			"Strategy": "The boss may augment his next mechanic with Double or his next two mechanics with Quadruple. \nThe main mechanic 'Hermetica' consists of large, green rectangles spawned at the edge of the arena. The order in which they appear indicates the order they fire. When the boss spawns these rectangles after meteors stand behind the uncracked meteors to break line of sight with the Hermetica AoEs to avoid damage.\nAlso interrupt the boss when he casts True Bravery, so he doesn't get a buff.",
			"KeyMechanics": [
				{
					"Name": "Trismegistos",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Double",
					"Description": "Augments the next spell.",
					"Type": 10
				},
				{
					"Name": "Quadruple",
					"Description": "Augments the next two spell.",
					"Type": 10
				},
				{
					"Name": "True Tornado",
					"Description": "Tankbuster. Also casts a circle AoE below the target if empowered by Double or Quadruple.",
					"Type": 0
				},
				{
					"Name": "True Bravery",
					"Description": "Boss receives a damage up buff. Cast can be interrupted.",
					"Type": 10
				},
				{
					"Name": "True Aero",
					"Description": "Targeted line AoEs at every player. Also casts an avoidable line AoE at the position of each player if empowered by Double or Quadruple.",
					"Type": 2
				},
				{
					"Name": "True Aero II",
					"Description": "Targeted line AoEs at every player. Also casts an avoidable line AoE at the position of each player if empowered by Double or Quadruple.",
					"Type": 6
				},
				{
					"Name": "Meteor",
					"Description": "4 proximity AoEs at the edges of the arena that leave a meteor behind that can block line of sight attacks.",
					"Type": 2
				},
				{
					"Name": "Hermetica",
					"Description": "Large green panels at the edge of the arena fire line AoEs that knock players back.\nThree sets of panels: \nSimply stand in the middle to avoid.\nTwo panels on two sides: \nDon't stand in the middle to avoid.\nEmpowered by Double: \nNeeds line of sight towards the panels to be broken with the Meteors. Cracked meteors break after one hit, uncracked meteors can take both hits.\nEmpowered by Quadruple:\nTwo panels spawn on each side in circular order. Move around the arena to avoid the line AoEs.",
					"Type": 2
				}
			]
		}
	]	
}