{
    "Version": 0,
    "Name": "The Aitiascope",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 89,
    "UnlockQuestID": 69985,
    "TerritoryID": 978,
    "Bosses": [
		{
			"Name": "Livia the Undeterred",
			"Strategy": "Simply evade AoEs and watch out for which of her tentacles start glowing to evade more AoEs.",
			"Mechanics": [
				{
					"Name": "Aglaea Bite",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Frustration",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Odi Et Amo",
					"Description": "Spawns circle AoEs under two random players, followed by a party stack.",
					"Type": 3
				},
				{
					"Name": "Disparagement",
					"Description": "Cone AoE towards the stack marker from Odi Et Amo after the stack resolves.",
					"Type": 2
				},
				{
					"Name": "Aglaea Climb",
					"Description": "The boss targets two quadrants of the arena with AoEs, indicated by which of her four tentacles glow.",
					"Type": 2
				},
				{
					"Name": "Aglaea Shot",
					"Description": "Shoots line AoEs towards the cardinals and intercadinals of the boss, which return in a second set of line AoEs afterwards.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Rhitahtyn the Unshakable",
			"Strategy": "Stay far away from his ground targeting markers and run into the gaps in the walls he summons once he breaks the crystals inside the walls.",
			"Mechanics": [
				{
					"Name": "Anvil of Tartarus",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Tartarean Impact",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Tartarean Spark",
					"Description": "Line AoE at a random player.",
					"Type": 2
				},
				{
					"Name": "Shrapnel Shell",
					"Description": "Two ground targeting markers spawn moving out from the boss towards two of the room's corners. When they reach them they will spawn several circle AoEs within that entire quadrant.",
					"Type": 2
				},
				{
					"Name": "Vexillatio",
					"Description": "Line AoEs at the two outer thirds of the arena that spawn solid walls with gaps blocked by purple crystals.",
					"Type": 2
				},
				{
					"Name": "Shield Skewer",
					"Description": "The boss absorbs aether from some of the purple crystals within the walls of Vexillatio, destroying them, before dashingthrough the middle in a line AoE.",
					"Type": 2
				}
			]
		},
		{
			"Name": "Amon the Undying",
			"Strategy": "When he casts Thundaga Forte look at the ground and stand in the sections where the lightning reaches the edge later, then move to the safe zone. Don't stand in front or behind the large purple magic circles. Look out which side of his Firaga Forte he will cast.\nWhen he casts Curtain Call, stand behind the huge ice crystal to break line of sight.",
			"Mechanics": [
				{
					"Name": "Dark Forte",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Entr'acte",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Eruption Forte",
					"Description": "Circle AoEs under two random players.",
					"Type": 2
				},
				{
					"Name": "Thundaga Forte",
					"Description": "Proximity AoE in the middle of the room, followed by the room being divided into eight cone shaped sections. These sections have lightning slowly moving along the ground towards the edge, with 4 sections in a cross shape reaching the edge first, while the other 4 sections reach it a bit later. Once the lightning reaches the edge these sections will go off in AoEs.",
					"Type": 2
				},
				{
					"Name": "Strophe",
					"Description": "Spawns a large, purple circle on the ground in the middle of the arena.",
					"Type": 10
				},
				{
					"Name": "Antistrophe",
					"Description": "Tilts the marker from Strophe vertically. Once it is standing up completely it will fire a line AoE into both directions of the circle.",
					"Type": 2
				},
				{
					"Name": "Left/Right Firaga Forte",
					"Description": "Half room AoE on the side indicated by the cast name.",
					"Type": 0
				},
				{
					"Name": "Curtain Call",
					"Description": "Lethal line of sight attack from the boss. Stand behind the large ice crystal to break line of sight and avoid damage.",
					"Type": 10
				}
			]
		}
	]
}