{
    "Version": 0,
    "Name": "The Dead Ends",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 90,
    "UnlockQuestID": 70000,
    "TerritoryID": 973,
    "Bosses": [
		{
			"Name": "Caustic Grebuloff",
			"Strategy": "Watch out in which direction the wind blows. This will indicate in which direction the upcoming AoEs travel. If someone gets hit by Miasmata they need to be dispelled with Esuna or else they die once the debuff runs out.",
			"KeyMechanics": [
				{
					"Name": "Miasmata",
					"Description": "Unavoidable raidwide damage, followed by toxic orbs. These orbs will explode in circle AoEs, which travel into the direction previously indicated by the wind. If a player gets hit by one of these they'll receive a Necrosis debuff that will kill them instantly if not dispelled with Esuna before it runs out.",
					"Type": 4
				},
				{
					"Name": "Cough Up",
					"Description": "Three sets of circle AoEs around each player, followed by a red triangle stack marker above each players heads. Players need to stack with at least one other person.",
					"Type": 2
				},
				{
					"Name": "Wave of Nausea",
					"Description": "Donut AoE around the boss.",
					"Type": 2
				},
				{
					"Name": "Pox Flail",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Blighted Water",
					"Description": "Party stack.",
					"Type": 3
				},
				{
					"Name": "Befoulment",
					"Description": "Targeted circle AoEs around all players.",
					"Type": 6
				}
			]
		},
		{
			"Name": "Peacekeeper",
			"Strategy": "This fight consists of a massive amount of AoEs that leave little room to evade. Players need to pay close attention to where AoEs hit and where safe spots are.",
			"KeyMechanics": [
				{
					"Name": "Decimation",
					"Description": "Unavoidable raidwide damage, followed by the outer ring of the arena being covered in fire.",
					"Type": 4
				},
				{
					"Name": "Electromagnetic Repellant",
					"Description": "Summons an electric field inside of the boss's hitbox that inflicts damage over time.",
					"Type": 2
				},
				{
					"Name": "Order To Fire",
					"Description": "Spawns bits around the boss that fire line AoEs straight outside.",
					"Type": 2
				},
				{
					"Name": "No Future",
					"Description": "Several large, traveling circle AoEs move either from the boss to the outside of the arena and then back in along the areas the previously weren't covered or vice versa. In either case the entire arena will be covered. Players must move into areas that have already been hit.",
					"Type": 2
				},
				{
					"Name": "Peacefire",
					"Description": "Large circle AoEs that rotate around the boss.",
					"Type": 2
				},
				{
					"Name": "Eclipsing Exhaust",
					"Description": "Circle AoEs near the outer edges of the arena with gaps inbetween, followed by a knockback from the middle.",
					"Type": 2
				},
				{
					"Name": "Elimination",
					"Description": "Line AoE tankbuster.",
					"Type": 0
				}
			]
		},
		{
			"Name": "Ra-la",
			"Strategy": "This boss uses several very delayed AoE attacks that need to be anticipated. If players get hit by the butterflies's laser beams they receive a lethal Doom debuff that can only be dispelled by fully healing their HP.",
			"KeyMechanics": [
				{
					"Name": "Warm Glow",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Pity",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Prance",
					"Description": "Boss jumps to each quadrant one by one, leaving a growing AoE markers, covering the entire arena. AoEs go off in the order they appear.",
					"Type": 2
				},
				{
					"Name": "Lifesbreath",
					"Description": "Boss jumps to the edge, firing a line AoE through the middle of the arena, leaving a line of butterflies that face each side of the room in alternating pairs, indicated by position circles below them. Shortly afterwards they fire a beam into the direction they're facing, which inflicts a deadly Doom debuff that can only be removed by fully healing players inflicted with it.",
					"Type": 0
				},
				{
					"Name": "Benevolence",
					"Description": "Party stack.",
					"Type": 3
				},
				{
					"Name": "Loving Embrace",
					"Description": "Half room AoE indicated by the boss's glowing wing.",
					"Type": 2
				},
				{
					"Name": "Still Embrace",
					"Description": "Targeted circle AoEs below all players.",
					"Type": 6
				}
			]
		}
	]
}