{
    "Version": 0,
    "Name": "Vanaspati",
    "Difficulty": 0,
    "Type": 0,
    "Expansion": 4,
    "Level": 85,
    "UnlockQuestID": 69945,
    "TerritoryID": 970,
    "Bosses": [
		{
			"Name": "Terminus Snatcher",
			"Strategy": "Stay away from mouths that are open watch the boss's animations to predict mechanics. Also has a spinning hand cursor mechanic that obstructs your movement.",
			"KeyMechanics": [
				{
					"Name": "Last Gasp",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Note of Despair",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Mouth Off",
					"Description": "The boss spawns mouths around the floor of the arena. The mouths that open will cast a large circle AoE around themselves.",
					"Type": 2
				},
				{
					"Name": "What Is Left/Right",
					"Description": "Half room AoE on the left/right side of the boss. His raised arm and cast indicate which side isn't safe.",
					"Type": 2
				},
				{
					"Name": "Lost Hope",
					"Description": "Places a spinning, pointing hand cursor above players heads. When players press a movement key the cursor stops spinning and the player moves into the direction the cursor is pointing.",
					"Type": 10
				},
				{
					"Name": "Wallow",
					"Description": "Targeted circle AoEs at all players.",
					"Type": 6
				}
			]
		},
		{
			"Name": "Terminus Wrecker",
			"Strategy": "The boss surrounds the arena with a damaging ring of fire. Try to not get knocked into it, and run into water orbs when he casts Aether Spray - Fire.",
			"KeyMechanics": [
				{
					"Name": "Total Wreck",
					"Description": "Tankbuster.",
					"Type": 0
				},
				{
					"Name": "Meaningless Destruction",
					"Description": "Unavoidable raidwide damage.",
					"Type": 0
				},
				{
					"Name": "Poison Heart",
					"Description": "Party stack.",
					"Type": 3
				},
				{
					"Name": "Unholy Water",
					"Description": "Summons water orbs around the arena. Running into them inflicts the player with Fetters and applies a Water Resistance Down debuff, but makes them immune against fire damage.",
					"Type": 10
				},
				{
					"Name": "Aether Siphon",
					"Description": "The boss absorbs aether from either the burning buildings or the nearby lake to cast another mechanic afterwards.",
					"Type": 10
				},
				{
					"Name": "Aether Spray - Fire",
					"Description": "Unavoidable raidwide damage that inflicts players with a 20 second Burns debuff. Can be completely negated by running into water orbs.",
					"Type": 4
				},
				{
					"Name": "Aether Spray - Water",
					"Description": "Large knockback from the center of the room.",
					"Type": 4
				}
			]
		},
		{
			"Name": "Svarbhanu",
			"Strategy": "When the boss casts Aetherial Disruption a large, coloured icon covering the whole screen will show which AoEs go off. When the boss flies to the edge of the arena to launch meteors at it there are set safe zones, as the boss always targets the same lines with his meteors. From left to right, on the first set line 2 is safe, on the second set it's line 3 and on the third set it's line 1.",
			"KeyMechanics": [
				{
					"Name": "Gnashing of Teeth",
					"Description": "Tankbuster",
					"Type": 0
				},
				{
					"Name": "Flames of Decay",
					"Description": "Unavoidable raidwide damage.",
					"Type": 4
				},
				{
					"Name": "Aetherial Disruption",
					"Description": "Dives the arena into four sections via two red and two blue line AoEs. A red circle or blue triangle in front of the screen will show which lines explode.",
					"Type": 2
				},
				{
					"Name": "Crumbling Sky (1)",
					"Description": "Casts either targeted circular AoEs around all players, or a short knockback from the center, or both. Used during Aetherial Disruption.",
					"Type": 10
				},
				{
					"Name": "Crumbling Sky (2)",
					"Description": "The boss flies out of the arena and starts launching sets of three meteors towards it that result in line AoEs, along with circular AoEs that are spawned in random locations.",
					"Type": 2
				}
			]
		}
	]
}